#Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#*Пример:*
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]
import math
print ("Задайте размер списка:")
n = int(input())
a = [0]*n

for i in range(len(a)):
    print (f'Заполните ячейку № {i}')
    a[i] = input()
mass = [int(x) for x in a]
two = [0]*math.ceil(n/2)
for i in range(0, math.ceil(n/2)):
    two[i] = mass[i]*mass[n-1-i]
print (f'Заданный список: \n {mass}')
print (f'Произведение пар чисел: \n {two}')

